#pragma once
// == Generated by CachyRS updater ==

struct Globals;
struct Engine;
struct Scene003;
struct Entity;

struct Globals
{
	PAD(0x18f950);
	char menu_execute;
	PAD(0x12b959f);
	Engine* engine;
	PAD(0x249fa0);
	Linux001* linux_001;
};
static_assert(offsetof(Globals, menu_execute) == 0x18f950, "Invalid offset");
static_assert(offsetof(Globals, engine) == 0x1448ef0, "Invalid offset");
static_assert(offsetof(Globals, linux_001) == 0x1692e98, "Invalid offset");

struct Engine
{
	PAD(0x90);
	WindowState* window_state;
	PAD(0x194a0);
	WorldA* world_a;
	PAD(0x18);
	Scene001* scene_001;
};
static_assert(offsetof(Engine, window_state) == 0x90, "Invalid offset");
static_assert(offsetof(Engine, world_a) == 0x19538, "Invalid offset");
static_assert(offsetof(Engine, scene_001) == 0x19558, "Invalid offset");

struct Scene003
{
	PAD(0x10170);
	WorldNode* world_root;
	PAD(0x3088);
	Matrix4x4 projection_matrix;
};
static_assert(offsetof(Scene003, world_root) == 0x10170, "Invalid offset");
static_assert(offsetof(Scene003, projection_matrix) == 0x13200, "Invalid offset");

struct Entity
{
	PAD(0x10);
	EntityType type;
	PAD(0x7f);
	JString name;
	PAD(0x1c8);
	Vec3<float> position;
};
static_assert(offsetof(Entity, type) == 0x10, "Invalid offset");
static_assert(offsetof(Entity, name) == 0x90, "Invalid offset");
static_assert(offsetof(Entity, position) == 0x270, "Invalid offset");

